let favoriteClub = prompt("აირჩიეთ თქვენი საყვარელი საფეხბურთო კლუბი:\n1. რეალი\n2. ბარსელონა\n3. იუვენტუსი\n4. მანჩესტერ იუნაიტედი\n5. ბაიერნი");

let message;

switch(favoriteClub) {
  case "1":
  case "რეალი":
    message = "თქვენი საყვარელი კლუბია რეალი";
    break;
  case "2":
  case "ბარსელონა":
    message = "თქვენი საყვარელი კლუბია ბარსელონა";
    break;
  case "3":
  case "იუვენტუსი":
    message = "თქვენი საყვარელი კლუბია იუვენტუსი";
    break;
  case "4":
  case "მანჩესტერ იუნაიტედი":
    message = "თქვენი საყვარელი კლუბია მანჩესტერ იუნაიტედი";
    break;
  case "5":
  case "ბაიერნი":
    message = "თქვენი საყვარელი კლუბია ბაიერნი";
    break;
  default:
    message = "თქვენ არ აირჩიეთ სავალდებულო ვარიანტებიდან";
}

alert(message);
