example_tuple = ("apple", "banana", "cherry", "date", "fig")
print("პირველი ორი ელემენტი: ", example_tuple[:2])  

numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)
print("23-ის რაოდენობა: ", numbers.count(23)) 

aura = (10, 25, 5, 80, 70, 20)
print("რიცხვები, რომლებიც 10-ზე დიდია: ")
for num in aura:
    if num > 10:
        print(num)

# 4. განსხვავება list-სა და tuple-ს შორის
# List არის ცვლადი (mutable) რაც ნიშნავს რომ მისი ელემენტების დამატება შეცვლა ან წაშლა შესაძლებელია
# Tuple არის უცვლელი (immutable) რაც ნიშნავს რომ ერთხელ შექმნის შემდეგ მისი შინაარსის შეცვლა შეუძლებელია

# 5. რას ნიშნავს immutable და mutable
# Mutable (ცვლადი) - ესაა მონაცემთა სტრუქტურა რომლის შიგთავსიც შეგვიძლია შევცვალოთ მაგ. list
# Immutable (უცვლელი) - ესაა მონაცემთა სტრუქტურა რომლის შიგთავსის ცვლილება შეუძლებელია მაგ. tuple
